foam-volume/OpenFOAM/openfoam-v2506/run/h42_frozensparse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
72100
(
(1.0169 -0.00166063 0)
(0.889288 -0.000204946 0)
(0.889925 -9.71951e-05 0)
(0.985242 9.85617e-05 0)
(0.970891 0.000109644 0)
(0.862811 9.85733e-05 0)
(0.864558 9.98109e-05 0)
(0.948394 0.000132382 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
175
(
(0.40343 2.91841e-07 0)
(1.49139 3.51282e-06 0)
(1.49139 3.51282e-06 0)
(2.60338 1.07763e-05 0)
(3.68359 2.22748e-05 0)
(4.63252 3.71277e-05 0)
(4.63252 3.71277e-05 0)
(5.40366 5.4285e-05 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
