foam-volume/OpenFOAM/openfoam-v2506/run/h42_frozensparse/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
72100
(
0.00919237
0.0088583
0.00885743
0.00891742
0.00874113
0.0084129
0.00836965
0.00837049
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
175
(
0.00395803
0.0105173
0.0105173
0.0678017
0.217957
0.429812
0.429812
0.628572
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
412
(
1.29133e-06
1.31101e-06
1.31101e-06
1.2859e-06
1.21812e-06
1.15563e-06
1.15563e-06
1.08963e-06
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
