foam-volume/OpenFOAM/openfoam-v2506/run/h42_frozensparse/0/omega
/*--------------------------------*- C++ -*----------------------------------*    | =========                 |                                                 |
    | \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
    |  \    /   O peration     | Version:  v2006                                 |
    |   \  /    A nd           | Website:  www.openfoam.com                      |
    |    \/     M anipulation  |                                                 |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       volScalarField;
        object      epsilon;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    
dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 17.764;

boundaryField
{
    bottom
    {
        type            omegaWallFunction;
		value			$internalField;
    }
    "(top|outlet)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
		value			nonuniform List<scalar>
    
    175 (
...
    }
    
    }
    // ************************************************************************* //