foam-volume/OpenFOAM/openfoam-v2506/run/h42_frozensparse/constant/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
72100
(
-0.100156
-0.0971489
-0.094169
-0.0912163
-0.0882904
-0.0853912
-0.0825183
-0.0796716
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
175
(
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
175
(
0.508313
0.508313
0.508313
0.508313
0.508313
0.508313
0.508313
0.508313
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
412
(
-0.100156
-0.0971489
-0.094169
-0.0912163
-0.0882904
-0.0853912
-0.0825183
-0.0796716
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
412
(
-0.100156
-0.0971489
-0.094169
-0.0912163
-0.0882904
-0.0853912
-0.0825183
-0.0796716
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
